Revit 2024 API
ImageExportOptions.ImageResolution Property
 The image resolution in dots per inch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public ImageResolution ImageResolution { get; set; }
Visual Basic
Public Property ImageResolution As ImageResolution
	Get
	Set
Visual C++
public:
property ImageResolution ImageResolution {
	ImageResolution get ();
	void set (ImageResolution value);
}
Remarks
 The default is DPI_72.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ImageExportOptions Class
Autodesk.Revit.DB Namespace